GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
uint8_t				crash_counter = 0;

uint8_t				CTRL_REG1_value			= 0x10;
uint8_t				PL_BF_ZCOMP_REG_value	= 0xc7;
uint8_t				PL_P_L_THS_REG_vlaue	= 0xcf;


/*
   读取
 */
#define TILT_NONE	0
#define TILT_ON		1
#define TILT_OFF	2

static uint32_t tilt_tick	= 0;            /*状态变化的时刻*/
static uint32_t tilt_status = TILT_NONE;    /*状态 0:正常 1:倾斜 2:倾斜回正*/
/*声明一个定时器，用来定时检查sensor*/
struct rt_timer tmr_sensor;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void EXTI9_5_IRQHandler( void )
{
	uint8_t ret, value1, value2, value3;
	rt_interrupt_enter( );
	if( EXTI_GetITStatus( EXTI_Line5 ) != RESET )
	{
		//ret = IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &value1 );	/*总是0x10*/
		ret = IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &value2 );
		ret = IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &value3 );
		//if((value2&0x7F)<0x40)	/*有倾斜发生  0x8x 倾斜发生*/
		if( value2 < 0xc0 )                     /*翻了*/
		{
			beep( 2, 1, 1 );
			if( tilt_status != TILT_ON )
			{
				tilt_tick	= rt_tick_get( );   /*记录当前翻的时刻*/
				tilt_status = TILT_ON;
			}
		}else /*0xcx 倾斜还原*/
		{
			tilt_tick	= rt_tick_get( );       /*记录当前翻的时刻*/
			tilt_status = TILT_OFF;
		}
		//rt_kprintf( "\nINT=%02x %02x\n", value2, value3 );
		EXTI_ClearITPendingBit( EXTI_Line5 );
	}
	rt_interrupt_leave( );
}

/*
   使用外部中断触发 PD5
 */

void EXTILine5_Config( void )
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	NVIC_InitTypeDef	NVIC_InitStructure;
	EXTI_InitTypeDef	EXTI_InitStructure;

	/* Enable GPIOD clock */
	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
	/* Enable SYSCFG clock */
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

	/* Configure PD5 pin as input floating */
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_5;
	GPIO_Init( GPIOD, &GPIO_InitStructure );

	/* Connect EXTI Line5 to PD5 pin */
	SYSCFG_EXTILineConfig( EXTI_PortSourceGPIOD, EXTI_PinSource5 );

	/* Configure EXTI Line5 */
	EXTI_InitStructure.EXTI_Line	= EXTI_Line5;
	EXTI_InitStructure.EXTI_Mode	= EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init( &EXTI_InitStructure );

	/* Enable and set EXTI Line0 Interrupt to the lowest priority */
	NVIC_InitStructure.NVIC_IRQChannel						= EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0x01;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0x01;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t mma8451_config( uint16_t param1, uint16_t param2 )
{
	unsigned char res, value;
	param_mma8451_word1 = param1;
	param_mma8451_word2 = param2;

//standby
	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value & ~ACTIVE_MASK ) ) )
	{
		goto lbl_mma8451_config_err;
	}


/*
   res = IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, CTRL_REG1_value);
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
 */
	if( IIC_RegWrite( MMA845X_ADDR, XYZ_DATA_CFG_REG, FULL_SCALE_4G ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*Step 2: Set the data rate to 50 Hz (for example, but can choose any sample rate).
	   CTRL_REG1_Data = IIC_RegRead(0x2A); //Note: Can combine this step with above
	   CTRL_REG1_Data& = 0xC7; //Clear the sample rate bits
	   CTRL_REG1_Data | = 0x20; //Set the sample rate bits to 50 Hz
	   IC_RegWrite(0x2A, CTRL_REG1_Data); //Write updated value into the register.
	 */


/*
   res = IIC_RegRead( MMA845X_ADDR, CTRL_REG1, &value );
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
   value	&= 0xC7;
   value	|= 0x20;
   res		= IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, value );
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
 */


	/*
	   Step 3: Set the PL_EN bit in Register 0x11 PL_CFG. This will enable the orientation detection.
	   PLCFG_Data = IIC_RegRead (0x11);
	   PLCFG_Data | = 0x40;
	   IIC_RegWrite(0x11, PLCFG_Data);
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_CFG_REG, 0xc0 ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*Step 4: Set the Back/Front Angle trip points in register 0x13 following the table in the data sheet.
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x13);
	   PL_BF_ZCOMP_Data& = 0x3F; //Clear bit 7 and 6
	   Select one of the following to set the B/F angle value:
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional and keeps bits [7:6] = 00
	   PL_BF_ZCOMP_Data | = 0x40; //Sets bits[7:6] = 01
	   PL_BF_ZCOMP_Data | = 0x80; //Sets bits[7:6] = 02
	   PL_BF_ZCOMP_Data | = 0xC0; //Sets bits[7:6] = 03
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Back/Front Angle

	   Step 5: Set the Z-Lockout angle trip point in register 0x13 following the table in the data sheet.
	   //NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x1C); //Read out contents of the register (can be read by all
	   versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   PL_BF_ZCOMP_Data& = 0xF8; //Clear the last three bits of the register
	   Select one of the following to set the Z-lockout value
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional but the Z-lockout selection will remain at
	   14°
	   PL_BF_ZCOMP_Data | = 0x01; //Set the Z-lockout angle to 18°
	   PL_BF_ZCOMP_Data | = 0x02; //Set the Z-lockout angle to 21°
	   PL_BF_ZCOMP_Data | = 0x03; //Set the Z-lockout angle to 25°
	   PL_BF_ZCOMP_Data | = 0x04; //Set the Z-lockout angle to 29°
	   PL_BF_ZCOMP_Data | = 0x05; //Set the Z-lockout angle to 33°
	   PL_BF_ZCOMP_Data | = 0x06; //Set the Z-lockout angle to 37°
	   PL_BF_ZCOMP_Data | = 0x07; //Set the Z-lockout angle to 42°
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Z-lockout angle
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_BF_ZCOMP_REG, PL_BF_ZCOMP_REG_value ) )
	{
		goto lbl_mma8451_config_err;
	}


