GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
	/*
	   Step 6: Set the Trip Threshold Angle
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   Select the angle desired in the table, and, Enter in the values given in the table for the corresponding angle.
	   Refer to Figure 7 for the reference frame of the trip angles.
	   P_L_THS_Data = IIC_RegRead(0x14); (can be read by all versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   P_L_THS_Data& = 0x07; //Clear the Threshold values
	   Choose one of the following options
	   P_L_THS_Data | = (0x07)<<3; //Set Threshold to 15°
	   P_L_THS_Data | = (0x09)<<3; //Set Threshold to 20°
	   P_L_THS_Data | = (0x0C)<<3; //Set Threshold to 30°
	   P_L_THS_Data | = (0x0D)<<3; //Set Threshold to 35°
	   P_L_THS_Data | = (0x0F)<<3; //Set Threshold to 40°
	   P_L_THS_Data | = (0x10)<<3; //Set Threshold to 45°
	   P_L_THS_Data | = (0x13)<<3; //Set Threshold to 55°
	   P_L_THS_Data | = (0x14)<<3; //Set Threshold to 60°
	   P_L_THS_Data | = (0x17)<<3; //Set Threshold to 70°
	   P_L_THS_Data | = (0x19)<<3; //Set Threshold to 75°
	   IIC_RegWrite(0x14, P_L_THS_Data);

	   Step 7: Set the Hysteresis Angle
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   Select the hysteresis value based on the desired final trip points (threshold + hysteresis)
	   Enter in the values given in the table for that corresponding angle.
	   Note: Care must be taken. Review the final resulting angles. Make sure there isn’t a resulting trip value
	   greater than 90 or less than 0.
	   The following are the options for setting the hysteresis.
	   P_L_THS_Data = IIC_RegRead(0x14);
	   NOTE: The remaining parts of this step only apply to the MMA8451Q.
	   P_L_THS_Data& = 0xF8; //Clear the Hysteresis values
	   P_L_THS_Data | = 0x01; //Set Hysteresis to ±4°
	   P_L_THS_Data | = 0x02; //Set Threshold to ±7°
	   P_L_THS_Data | = 0x03; //Set Threshold to ±11°
	   P_L_THS_Data | = 0x04; //Set Threshold to ±14°
	   P_L_THS_Data | = 0x05; //Set Threshold to ±17°
	   P_L_THS_Data | = 0x06; //Set Threshold to ±21°
	   P_L_THS_Data | = 0x07; //Set Threshold to ±24°
	   IIC_RegWrite(0x14, P_L_THS_Data);
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_P_L_THS_REG, PL_P_L_THS_REG_vlaue ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 8: Register 0x2D, Control Register 4 configures all embedded features for interrupt
	   detection.
	   To set this device up to run an interrupt service routine:
	   Program the Orientation Detection bit in Control Register 4.
	   Set bit 4 to enable the orientation detection “INT_EN_LNDPRT”.
	   CTRL_REG4_Data = IIC_RegRead(0x2D); //Read out the contents of the register
	   CTRL_REG4_Data | = 0x10; //Set bit 4
	   IIC_RegWrite(0x2D, CTRL_REG4_Data); //Set the bit and write into CTRL_REG4
	 */

	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG4, 0x10 ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 9: Register 0x2E is Control Register 5 which gives the option of routing the interrupt to
	   either INT1 or INT2
	   Depending on which interrupt pin is enabled and configured to the processor:
	   Set bit 4 “INT_CFG_LNDPRT” to configure INT1, or,
	   Leave the bit clear to configure INT2.
	   CTRL_REG5_Data = IIC_RegRead(0x2E);
	   In the next two lines choose to clear bit 4 to route to INT2 or set bit 4 to route to INT1
	   CTRL_REG5_Data& = 0xEF; //Clear bit 4 to choose the interrupt to route to INT2
	   CTRL_REG5_Data | = 0x10; //Set bit 4 to choose the interrupt to route to INT1
	   IIC_RegWrite(0x2E, CTRL_REG5_Data); //Write in the interrupt routing selection
	 */
	//value=IIC_RegRead(MMA845X_ADDR,CTRL_REG5);
	////value&=0xEF;
	//value |= 0x10;  // INT1
	//IIC_RegWrite(MMA845X_ADDR,CTRL_REG5,value);


	/*
	   Step 10: Set the debounce counter in register 0x12
	   This value will scale depending on the application-specific required ODR.
	   If the device is set to go to sleep, reset the debounce counter before the device goes to sleep. This setting
	   helps avoid long delays since the debounce will always scale with the current sample rate. The debounce
	   can be set between 50 ms - 100 ms to avoid long delays.
	   IIC_RegWrite(0x12, 0x05); //This sets the debounce counter to 100 ms at 50 Hz
	 */

	res = IIC_RegWrite( MMA845X_ADDR, PL_COUNT_REG, 0x02 );
	if( res )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 11: Put the device in Active Mode
	   CTRL_REG1_Data = IIC_RegRead(0x2A); //Read out the contents of the register
	   CTRL_REG1_Data | = 0x01; //Change the value in the register to Active Mode.
	   IIC_RegWrite(0x2A, CTRL_REG1_Data); //Write in the updated value to put the device in Active Mode
	 */

//	value=IIC_RegRead(MMA845X_ADDR,CTRL_REG1);
//	value |= 0x01;
//	IIC_RegWrite(MMA845X_ADDR,CTRL_REG1,value);
//active

/*TAP设置*/
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_CFG_REG, 0xd5 ) )
	{
		goto lbl_mma8451_config_err;
	}

	//加速度门限 0.1g 1-79	扩展为0.0625  1-127  扩大1.6倍


/*
   res = ( ( param_mma8451_word2 & 0xff00 ) >> 8 ) * 1.6;

   if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSX_REG, res ) )
   {
   goto lbl_mma8451_config_err;
   }
   if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSY_REG, res ) )
   {
   goto lbl_mma8451_config_err;
   }
   if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSZ_REG, res ) )
   {
   goto lbl_mma8451_config_err;
   }

   res = param_mma8451_word2 & 0xff;
   if( IIC_RegWrite( MMA845X_ADDR, PULSE_TMLT_REG, res ) )
   {
   goto lbl_mma8451_config_err;
   }
 */

	res = ( param_mma8451_word2 & 0xff ) * 1.6;

	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSX_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSY_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSZ_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}

	res = ( param_mma8451_word2 & 0xff00 ) >> 8;
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_TMLT_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}

	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value | ACTIVE_MASK ) ) )
	{
		goto lbl_mma8451_config_err;
	}

