GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG4, 0x18 ) )
	{
		goto lbl_mma8451_config_err;
	}

	return ERR_NONE;

lbl_mma8451_config_err:
	return res;
}

FINSH_FUNCTION_EXPORT( mma8451_config, setup sensor );


/*
   碰撞时间门限
   碰撞加速度门限

   指定时间门限内，加速度持续大于门限即为碰撞
 */

static uint8_t sensor_info[2] = { 0 };


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t mma8451_init( rt_device_t dev )
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	uint16_t			res;
	uint16_t			param1	= 0x8000, param2 = 0x1e02;
	uint16_t			i		= 0;

	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOB, ENABLE );
	/*去掉JTAG功能*/
	GPIO_PinAFConfig( GPIOB, GPIO_Pin_4, 1 );

	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_25MHz;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;   /*SCL*/
	GPIO_Init( GPIOB, &GPIO_InitStructure );

	GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;   /*SDA*/
	GPIO_Init( GPIOB, &GPIO_InitStructure );
	SCL_H;
	SDA_H;
	mma8451_config( param_mma8451_word1, param_mma8451_word2 );
	EXTILine5_Config( );
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_open( rt_device_t dev, rt_uint16_t oflag )
{
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	uint8_t code = *(uint8_t*)arg;
	int		i;
	switch( cmd )
	{
	}
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_close( rt_device_t dev )
{
	return RT_EOK;
}

/*

   传感器处理线程
   原先为函数方式，现在采用线程，使用状态机
 */

#define MMA8451_CONFIG	1
#define MMA8451_TILT	2   /*倾斜检测*/
#define MMA8451_TAP		3   /*震动检测*/

#if 0
ALIGN( RT_ALIGN_SIZE )
static char thread_sensor_stack[512];
struct rt_thread thread_sensor;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_sensor( void* parameter )
{
	uint8_t		int_source, pl;
	uint16_t	res;
	uint8_t		status = MMA8451_CONFIG;
	while( 1 )
	{
		if( ( param_mma8451_word1 & 0x8000 ) == 0x0 )
		{
			continue;
		}
		switch( status )
		{
			case MMA8451_CONFIG:
				res = mma8451_config( param_mma8451_word1, param_mma8451_word2 );
				if( res == 0 )
				{
					status = MMA8451_TILT;
				}
				break;
			case MMA8451_TILT:
				res = IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &int_source );
				if( res )
				{
					status = MMA8451_CONFIG;
					break;;
				}

				if( ( int_source & 0x10 ) == 0x10 )
				{
					res = IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &pl );
					if( res )
					{
						status = MMA8451_CONFIG;
						break;;
					}

					if( ( sensor_info[0] & 0x40 ) == 0x40 ) //首次使用,不发送
					{
						if( ( rt_tick_get( ) - lastsend_rotation_ticks ) > 1000 )
						{
							rt_kprintf( "\r\n%d>pl=%02x", rt_tick_get( ), pl );
							if( pl != last_plstatus )
							{
								//uart2_send_frame( '2', 2, sensor_info, 1 );
								last_plstatus = pl;
							}
							lastsend_rotation_ticks = rt_tick_get( );
						}
					}else
					{
						rt_kprintf( "\r\n%d>First pl=%02x", rt_tick_get( ), pl );
					}
					sensor_info[0] |= 0x40;
				}
				break;

			case MMA8451_TAP:
				res = IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &int_source );
				if( res )
				{
					status = MMA8451_CONFIG;
					break;;
				}

				if( int_source >= 0x80 )
				{
					if( ( rt_tick_get( ) - lastsend_crash_ticks ) > 1000 )
					{
						sensor_info[0] |= 0x80;
						//uart2_send_frame( '2', 2, sensor_info, 1 );
						lastsend_crash_ticks = rt_tick_get( );
					}
					rt_kprintf( "\r\n%d>PULSE_SRC_REG=%02x", rt_tick_get( ), int_source );
				}
				break;
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	}
}

#endif


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void cb_tmr_sensor( void* parameter )
{
	if( tilt_status == TILT_ON )
	{
		if( rt_tick_get( ) - tilt_tick > 300 ) /*3秒*/
		{
			if( ( jt808_alarm & BIT_ALARM_TILT ) == 0 )
			{
				rt_kprintf( "\n侧翻" );
			}
			jt808_alarm |= ( BIT_ALARM_TILT );
		}
	}
	if( tilt_status == TILT_OFF )
	{
		if( rt_tick_get( ) - tilt_tick > 300 ) /*3秒*/
		{
			jt808_alarm &= ~( BIT_ALARM_TILT );
			tilt_status = TILT_NONE;
			rt_kprintf( "\n侧翻回正" );
		}
	}
}

/***/
void mma8451_driver_init( void )
{
/*
   rt_thread_init( &thread_sensor,
                 "sensor",
                 rt_thread_entry_sensor,
                 RT_NULL,
                 &thread_sensor_stack[0],
                 sizeof( thread_sensor_stack ), 22, 5 );
   rt_thread_startup( &thread_sensor );
 */
	dev_mma8451.type		= RT_Device_Class_Char;
	dev_mma8451.init		= mma8451_init;
	dev_mma8451.open		= mma8451_open;
	dev_mma8451.close		= mma8451_close;
	dev_mma8451.read		= mma8451_read;
	dev_mma8451.write		= mma8451_write;
	dev_mma8451.control		= mma8451_control;
	dev_mma8451.user_data	= RT_NULL;

	rt_device_register( &dev_mma8451, "sensor", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_mma8451 );

	rt_timer_init( &tmr_sensor, "tmr_sensor",   /* 定时器名字是 tmr_sensor */
	               cb_tmr_sensor,               /* 超时时回调的处理函数 */
	               RT_NULL,                     /* 超时函数的入口参数 */
	               RT_TICK_PER_SECOND / 10,     /* 定时长度，以OS Tick为单位 */
	               RT_TIMER_FLAG_PERIODIC );    /* 周期性定时器 */

	rt_timer_start( &tmr_sensor );
}

/************************************** The End Of File **************************************/
